---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.SiteFailures
source: html/a5da51e3-90a0-7a65-ebf9-348d8b20d6f7.htm
---
# BuiltInFailures.SiteFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.